Public Attributes | List of all members
ACAPI::MEP::PipeTransitionPreferenceTable::Key Struct Reference
MEP Element Manager
The key that uniquely identifies a row in the PipeTransitionPreferenceTable. More...
#include <MEPPipeTransitionPreferenceTable.hpp>
 Public Attributes
 uint32_t  | beginReferenceId
The begin referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
 uint32_t  | endReferenceId
The end referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
Detailed Description
The key that uniquely identifies a row in the PipeTransitionPreferenceTable.
Since
Archicad 29